{
  "title": "Hi there!",
  "description": "I am a student at University S. I don't have enough pocket money, so I decided to get a tutor through a tutoring platform.",
  "mission1": "I need to get a certificate of enrollment from my school.",
  "mission2": "I need to submit the received certificate of attendance to the tutoring platform.",
  "viewCode": "view Code",
  "school": "🏫  School",
  "credentailDesc1": "We asked the school to issue a college certificate, and now the Issuer is going to issue the certificate, and let's say the school has given us permission to do Selective Disclosure for ['name', 'studentId', 'department'].",
  "credentailDesc2": "When you run the mint function, the VC is minted, but why does the token keep changing every time you press the mint button? It's because we internally add a salt value and run a hash function to generate a new value for each mint.",
  "credentailDesc3": "I took the token and tried to decode it on the SD-JWT and JWT debugging site, so if you run the encode function as we know it, you can see that the frame is hidden as shown on the right. If you look at the encode state on the left, the original object is still visible. The important thing is that we only specified that it can be hidden, not that it is completely hidden.",
  "link1": "(link) decoded via the SD-JWT debugging site",
  "link2": "link) decoded via JWT debugging site",
  "issue": "Issue a certificate.",
  "getClaims": "Release tokens (get Claims)",
  "complete": "The school just finished issuing certificates of enrollment.",
  "thisIsVc": "That's VC.",
  "letsIssue": "issue",
  "chapter1": "Issue a certificate of enrollment",
  "me": "👩‍💻 Me",
  "disclosure": "Reveal only the information you need",
  "issuePresent": "My school has issued me a verification of enrollment (VC), but there is some information I don't want to make public. I'm going to self-select the information disclosed in the VC that I want to make public and submit it to the tutoring platform. Using the VC, we will now create a VP. Now that I think about it, I think it's okay to disclose my name, but I still don't want to disclose the other information.",
  "present": "present",
  "presentDesc2": "When I run the present function, I'm issued a VP based on VC. I've decided what information I want to reveal when I run the present function, let's unlock the token.",
  "presentDesc3": "I used the present function to create a certificate that combines only the information I want to make public! I'll call it a VP, and now all I have to do is submit it to the tutoring platform.",
  "platform": "📲 Tutoring platform",
  "provingYoutCredentials": "Proving your credentials",
  "verify": "verify",
  "verifyDesc1": "The attestation is complete, the platform side puts in the required elements (requiredClaims) and verifies if it is a manipulated token or not, you have completed all the steps, congratulations!",
  "verifyComplete": "Verified Complete",
  "verifyDes1": "Now the platform has to verify this certificate. If the signature is changed or the VP is manipulated, there's obviously a problem. The tutoring platform will now verify the VP."
}
